#include <fstream>
#include <iostream>
#include "Functions.h"
#include "Constants.h"

/*
2.5. [# 50] Раскрасить заданный граф, используя алгоритм Ершова.
Вход. Первая строка исходного файла содержит целое число 𝑣 (1 ≤ 𝑣 ≤ 400) –
количество вершин. В последующих 𝑣 строках содержатся по 𝑣 чисел, разделенных
пробелами: вес ребер между вершинами. Вершины пронумерованы от 1 до 𝑣
Выход. В 𝑣 строчках вывести по два числа: номер вершин (от 1 до 𝑣) и номер цвета
вершины (нумерация цветов начинается с 1)
*/

//Переделать по презентации
int main() {
    int v;
    ifstream in(config);
    in >> v;

    // Создание и инициализация графа
    vector<vector<int>> graph(v, vector<int>(v));
    for (int i = 0; i < v; i++) {
        for (int j = 0; j < v; j++) {
            in >> graph[i][j];
        }
    }

    // Раскраска графа
    vector<int> colors = colorGraph(graph);

    // Вывод номеров вершин и их цветов
    for (int i = 0; i < v; i++) {
        cout << (i + 1) << " " << colors[i] << endl;
    }

    return 0;
}